{
	"latest_version_code": 7,
	"latest_version_name": "beta-1",
	"latest_version_download_url": "https://github.com/MrShieh-X/mschatroom/releases/download/beta-1/mscr_beta-1-release.apk",
	"update_date": "2021-01-21",
	"update_content_enUS": "(Some models may be invalid) Added the function of clearing cache and clearing application data, you can see them on the Settings interface.\n(Some models may be invalid) Logout can choose whether to delete the added chats and chat files.\nThe first startup will get whether the system display interface is a dark theme or a light theme, and save it in SharedPreferences.\nFixed the problem that the email address cannot be used to login.\nFixed the problem that may crash after modifying user information.\nFixed the problem that language and theme information could not be saved when starting the app for the first time.\nOptimized the code to Modify User Information interface to make this interface more stable.\nAdded the \"Verifying\" dialog to verify the password after entering the password of the deleted account.\nAdded the function of deleting chats. This option is located in the menu that pops up by long pressing any item on the Main interface.\nWhen you add a chat, if your target account has been added, it will prompt \"\"(target account)\" This chat has been added, it is the \"(current list of chats)\" of the current list\nAdded the ability to check for updates, which is located on the about interface.\nYou can choose a picture in other apps to open it with the picture viewer of this app.\nAdded the function of zooming in the picture viewer.\nAdded \"LoadingScreen\" (loading interface), this interface is used to load part of the information of the logged-in account. The function is that the Main interface, Setting interface and Modify User Information interface after starting do not need to be loaded again, so that the application runs faster.\nAdded \"Developer Options\" interface, which can be used to modify the server information, etc.\nThe application will establish a connection to the server every time it starts the interface, and there is no need to establish it again afterwards, saving time.\nMany problems have been fixed to make the application more stable.",
	"update_content_zhCN": "（某些机型可能无效）添加了清除缓存和清除应用数据的功能，您可在设置页面看到它们。\n（某些机型可能无效）退出登录可以选择是否删除添加的聊天和聊天的文件。\n首次启动会检测系统是暗主题或亮主题，而保存到 SharedPreferences 里面。\n修复了不能使用邮箱地址登录的问题。\n修复了修改用户信息可能闪退的问题。\n修复了首次进入应用保存不了语言和主题信息的问题。\n优化了修改用户信息页面的代码，使此界面更稳定。\n添加了输入删除账户的密码后验证密码的“验证中”对话框。\n添加了删除聊天的功能，该选项位于主界面长按任意一项聊天弹出的菜单。\n当您添加一个聊天时，如果您的目标账户已添加，会提示““（目标账户）” 此聊天已添加，它是当前列表的 “（当前列表的的聊天）””\n添加了检查更新的功能，此功能位于关于页面。\n在其它应用选择图片可选择使用本应用的图片查看器打开。\n添加了图片查看器缩放的功能。\n添加了“LoadingScreen”（加载界面），此界面用于加载已登录账户的部分信息，作用是进去后的主界面、设置界面和修改用户信息页面不用再次加载，使应用运行速度变快。\n添加了“开发者选项”，此界面可用于修改服务器信息等。\n应用每次进入界面都会于服务器建立一次连接，之后不用再次建立，节省时间。\n修复了许多问题，使应用更稳定。"
}